Tekla.Structures.Filtering.InvalidFilterExpressionExceptionReasonsType
The invalid filter expression exception reasons type defines the possible reasons for the
InvalidFilterExpressionException.

Tekla.Structures.Filtering.InvalidFilterExpressionExceptionReasonsType.TOO_MANY_NESTED_COLLECTIONS
There are too many nested collections.